espressif/esp-idf/components/soc/esp32p4/include/soc/lcdcam_struct.h
/** Type of lcd_misc register
 *  LCD config register.
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** lcd_wire_mode : R/W; bitpos: [5:4]; default: 0;
         *  The wire width of LCD output. 0: 8bit. 1: 16bit 2: 24bit
         */
        uint32_t lcd_wire_mode:2;
        /** lcd_vfk_cyclelen : R/W; bitpos: [11:6]; default: 3;
         *  The setup cycle length minus 1 in LCD non-RGB mode.
         */
        uint32_t lcd_vfk_cyclelen:6;
        /** lcd_vbk_cyclelen : R/W; bitpos: [24:12]; default: 0;
         *  The vertical back blank region cycle length minus 1 in LCD RGB mode, or the hold
         *  time cycle length in LCD non-RGB mode.
         */
        uint32_t lcd_vbk_cyclelen:13;
        /** lcd_next_frame_en : R/W; bitpos: [25]; default: 0;
         *  1: Send the next frame data when the current frame is sent out. 0: LCD stops when
         *  the current frame is sent out.
         */
        uint32_t lcd_next_frame_en:1;
        /** lcd_bk_en : R/W; bitpos: [26]; default: 0;
         *  1: Enable blank region when LCD sends data out. 0: No blank region.
         */
        uint32_t lcd_bk_en:1;
        /** lcd_afifo_reset : WT; bitpos: [27]; default: 0;
         *  LCD AFIFO reset signal.
         */
        uint32_t lcd_afifo_reset:1;
        /** lcd_cd_data_set : R/W; bitpos: [28]; default: 0;
         *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DOUT state.  0: LCD_CD =
         *  reg_cd_idle_edge.
         */
        uint32_t lcd_cd_data_set:1;
        /** lcd_cd_dummy_set : R/W; bitpos: [29]; default: 0;
         *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DUMMY state.  0: LCD_CD =
         *  reg_cd_idle_edge.
         */
        uint32_t lcd_cd_dummy_set:1;
        /** lcd_cd_cmd_set : R/W; bitpos: [30]; default: 0;
         *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_CMD state.  0: LCD_CD =
         *  reg_cd_idle_edge.
         */
        uint32_t lcd_cd_cmd_set:1;
        /** lcd_cd_idle_edge : R/W; bitpos: [31]; default: 0;
         *  The default value of LCD_CD.
         */
        uint32_t lcd_cd_idle_edge:1;
    };
    uint32_t val;
} lcdcam_lcd_misc_reg_t;

/** Type of lcd_ctrl register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_hb_front : R/W; bitpos: [10:0]; default: 0;
         *  It is the horizontal blank front porch of a frame.
         */
        uint32_t lcd_hb_front:11;
        /** lcd_va_height : R/W; bitpos: [20:11]; default: 0;
         *  It is the vertical active height of a frame.
         */
        uint32_t lcd_va_height:10;
        /** lcd_vt_height : R/W; bitpos: [30:21]; default: 0;
         *  It is the vertical total height of a frame.
         */
        uint32_t lcd_vt_height:10;
        /** lcd_rgb_mode_en : R/W; bitpos: [31]; default: 0;
         *  1: Enable LCD RGB mode. 0: Disable LCD RGB mode.
         */
        uint32_t lcd_rgb_mode_en:1;
    };
    uint32_t val;
} lcdcam_lcd_ctrl_reg_t;

/** Type of lcd_ctrl1 register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_vb_front : R/W; bitpos: [7:0]; default: 0;
         *  It is the vertical blank front porch of a frame.
         */
        uint32_t lcd_vb_front:8;
        /** lcd_ha_width : R/W; bitpos: [19:8]; default: 0;
         *  It is the horizontal active width of a frame.
         */
        uint32_t lcd_ha_width:12;
        /** lcd_ht_width : R/W; bitpos: [31:20]; default: 0;
         *  It is the horizontal total width of a frame.
         */
        uint32_t lcd_ht_width:12;
    };
    uint32_t val;
} lcdcam_lcd_ctrl1_reg_t;

/** Type of lcd_ctrl2 register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_vsync_width : R/W; bitpos: [6:0]; default: 1;
         *  It is the position of LCD_VSYNC active pulse in a line.
         */
        uint32_t lcd_vsync_width:7;
        /** lcd_vsync_idle_pol : R/W; bitpos: [7]; default: 0;
         *  It is the idle value of LCD_VSYNC.
         */
        uint32_t lcd_vsync_idle_pol:1;
        /** lcd_de_idle_pol : R/W; bitpos: [8]; default: 0;
         *  It is the idle value of LCD_DE.
         */
        uint32_t lcd_de_idle_pol:1;
        /** lcd_hs_blank_en : R/W; bitpos: [9]; default: 0;
         *  1: The pulse of LCD_HSYNC is out in vertical blanking lines RGB mode. 0: LCD_HSYNC
         *  pulse is valid only in active region lines in RGB mode.
         */
        uint32_t lcd_hs_blank_en:1;
        uint32_t reserved_10:6;
        /** lcd_hsync_width : R/W; bitpos: [22:16]; default: 1;
         *  It is the position of LCD_HSYNC active pulse in a line.
         */
        uint32_t lcd_hsync_width:7;
        /** lcd_hsync_idle_pol : R/W; bitpos: [23]; default: 0;
         *  It is the idle value of LCD_HSYNC.
         */
        uint32_t lcd_hsync_idle_pol:1;
        /** lcd_hsync_position : R/W; bitpos: [31:24]; default: 0;
         *  It is the position of LCD_HSYNC active pulse in a line.
         */
        uint32_t lcd_hsync_position:8;
    };
    uint32_t val;
} lcdcam_lcd_ctrl2_reg_t;

/** Type of lcd_first_cmd_val register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_first_cmd_value : R/W; bitpos: [31:0]; default: 0;
         *  The LCD write command value of first cmd cycle.
         */
        uint32_t lcd_first_cmd_value:32;
    };
    uint32_t val;
} lcdcam_lcd_first_cmd_val_reg_t;

/** Type of lcd_latter_cmd_val register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_latter_cmd_value : R/W; bitpos: [31:0]; default: 0;
         *  The LCD write command value of latter cmd cycle.
         */
        uint32_t lcd_latter_cmd_value:32;
    };
    uint32_t val;
} lcdcam_lcd_latter_cmd_val_reg_t;

/** Type of lcd_dly_mode_cfg1 register
 *  LCD config register.
 */
typedef union {
    struct {
        /** dout16_mode : R/W; bitpos: [1:0]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout16_mode:2;
        /** dout17_mode : R/W; bitpos: [3:2]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout17_mode:2;
        /** dout18_mode : R/W; bitpos: [5:4]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout18_mode:2;
        /** dout19_mode : R/W; bitpos: [7:6]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout19_mode:2;
        /** dout20_mode : R/W; bitpos: [9:8]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout20_mode:2;
        /** dout21_mode : R/W; bitpos: [11:10]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout21_mode:2;
        /** dout22_mode : R/W; bitpos: [13:12]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout22_mode:2;
        /** dout23_mode : R/W; bitpos: [15:14]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout23_mode:2;
        /** lcd_cd_mode : R/W; bitpos: [17:16]; default: 0;
         *  The output LCD_CD is delayed by module clock LCD_CLK. 0: output without delayed. 1:
         *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
         */
        uint32_t lcd_cd_mode:2;
        /** lcd_de_mode : R/W; bitpos: [19:18]; default: 0;
         *  The output LCD_DE is delayed by module clock LCD_CLK. 0: output without delayed. 1:
         *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
         */
        uint32_t lcd_de_mode:2;
        /** lcd_hsync_mode : R/W; bitpos: [21:20]; default: 0;
         *  The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
         *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
         */
        uint32_t lcd_hsync_mode:2;
        /** lcd_vsync_mode : R/W; bitpos: [23:22]; default: 0;
         *  The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
         *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
         */
        uint32_t lcd_vsync_mode:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} lcdcam_lcd_dly_mode_cfg1_reg_t;

